[net]
batch=16
subdivisions=1
height=28
width=28
channels=1
momentum=0.9
decay=0.0005

learning_rate=0.4
policy=poly
power=4
max_batches=128
momentum=0.9
decay=0.0005

[convolutional]
batch_normalize=1
filters=8
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=10
size=3
stride=1
pad=1
activation=leaky

[avgpool]

[softmax]
groups=1

[cost]
type=sse
